{
    "version": "https://jsonfeed.org/version/1",
    "title": "BABFO",
    "description": "",
    "home_page_url": "https://babfo.org",
    "feed_url": "https://babfo.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "Thatea Fanai"
    },
    "items": [
        {
            "id": "https://babfo.org/be-a-blessing-for-others-2/",
            "url": "https://babfo.org/be-a-blessing-for-others-2/",
            "title": "Be A Blessing For Others",
            "summary": "Gen. 12:1-5 Now the Lord said to Abram, “Go from your country and your kindred and your father’s house to the land that I will show you. 2 I will make of you a great nation, and I will bless you, and make your name great,&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/Blessing.jpg\" alt=\"\" width=\"1154\" height=\"649\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-xs.jpg 640w ,file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-sm.jpg 768w ,file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-md.jpg 1024w ,file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-lg.jpg 1366w ,file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-xl.jpg 1600w ,file:///C:/Users/fptha/OneDrive/Documents/Publii/sites/babfo/input/media/posts/5/responsive/Blessing-2xl.jpg 1920w\"></figure>\n<p> </p>\n<p><strong>Gen. 12:1-5</strong> Now the Lord said to Abram, “Go from your country and your kindred and your father’s house to the land that I will show you. <sup>2 </sup>I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. <sup>3 </sup>I will bless those who bless you, and the one who curses you I will curse; and in you all the families of the earth shall be blessed.”[<a href=\"https://www.biblegateway.com/passage/?search=Genesis+12&amp;version=NRSV#fen-NRSV-302a\">a</a>]<sup> </sup><sup>4 </sup>So Abram went, as the Lord had told him; and Lot went with him. Abram was seventy-five years old when he departed from Haran. <sup>5 </sup>Abram took his wife Sarai and his brother’s son Lot, and all the possessions that they had gathered, and the persons whom they had acquired in Haran; and they set forth to go to the land of Canaan.</p>\n<p>Good morning,</p>\n<p><strong>Mission as blessing for others.</strong></p>\n<p>To become a blessing for others what can we learn from the life of Abraham:</p>\n<ol>\n<li><strong> </strong><strong>Leaving comfort zone:</strong> 7:2-3 | God called Abram (Abraham) while they were in the city of Ur. It was one of the largest cities in Mesopotamia. It is not doubtful that Abraham and his family lived well. But, he pursued God’s calling to be a blessing for others.</li>\n</ol>\n<p><em>For us also, to be a blessing for others, we need to live our comfort zones. We often need to sacrifice our joy and likes. Sometimes, it is heard to leave our comfort zone, but if we want to be a blessing for others, we must ready to leave and sacrifices what we hold on so dearly as well.</em></p>\n<ol start=\"2\">\n<li><strong> </strong><strong>Putting others first: </strong>As we have seen in Gen. 12:4-5, Abraham took Lot his nephew and his wife Sarah with him. They lived together for some years. But, the times come when they need to be separated because of their wealth. What Abraham did was so great – that he put first other (Lot) to chose tha land.</li>\n</ol>\n<p><em>It is not always easy to put others especially in a situation and occasion like that. But, putting others first did not fail and stop Abraham receiving the blessing of God. As a result, he put himself in a safer place by putting others first.</em></p>\n<ol start=\"3\">\n<li><strong> </strong><strong>Compassion and Empathy to others: </strong>Lot went away from Abraham towards the land of Sodom and Gomorrah. But they were attacked and invaded by the elite force. When Abraham was informed, he had he had a compassion, an empathy for them. He took a step to fight for them taking his servants. And, they fought and win.</li>\n</ol>\n<p><em>In order to be a blessing for others, compassion, sympathy and empathy is very much needed. And not only that, it takes courage as well. We see many people surrounds us who are oppressed by different forces and traditions, who are very badly in need of helper. What do we do as a Christian? There are countless souls who need God’s salvation, do we have compassion for them? Are we dare to go and serve God among them?</em></p>\n<ol start=\"4\">\n<li><strong> </strong><strong>Pleading for others: </strong>In Gen. 18<strong>:</strong>1-16-33,<strong> </strong>we have seen that<strong> </strong>God tried to punish Sodom and Gomorrah for their unforgivable sin. There we see Abraham plead for the people. However, unfortunately punishment was given even though God ready to forgive the city at least if there are 10 righteous people.</li>\n</ol>\n<p><em>How many times we offer our supplication for others? Do we think that we offer enough prayer for others? Or we are satisfied as long as we received God’s blessing. We can become a blessing for others by praying for them.</em></p>\n<ol start=\"5\">\n<li><strong> </strong><strong>Faith – Trust in God:</strong> Abraham was called ‘Father of faith.’ Indeed, when he asked his son Isaac to offer as a sacrifice. Abraham did not question him. This might sounds very awkward and stupid. However, did Abraham lose his son? No. In stead he become a father of Faith.</li>\n</ol>\n<p><em>In life, there are some situations, which demands a foolish action (from the sight of worldly things). But, putting God first and trusting in God brings victory. </em></p>",
            "author": {
                "name": "Thatea Fanai"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T12:01:22+05:30",
            "date_modified": "2025-09-16T12:01:22+05:30"
        }
    ]
}
